{"meta":{"title":"Recopec","subtitle":"","description":"喵","author":"Recopec","url":"https://blog.irec.moe","root":"/"},"pages":[{"title":"links","date":"2013-07-13T12:46:25.000Z","updated":"2022-05-18T12:56:25.218Z","comments":true,"path":"PY.html","permalink":"https://blog.irec.moe/PY.html","excerpt":"","text":""}],"posts":[{"title":"3年大专&专升本上岸记录","slug":"湖南理工学院专升本上岸记录","date":"2022-05-18T13:15:31.450Z","updated":"2022-07-30T13:35:33.907Z","comments":true,"path":"2022/05/18/湖南理工学院专升本上岸记录/","link":"","permalink":"https://blog.irec.moe/2022/05/18/%E6%B9%96%E5%8D%97%E7%90%86%E5%B7%A5%E5%AD%A6%E9%99%A2%E4%B8%93%E5%8D%87%E6%9C%AC%E4%B8%8A%E5%B2%B8%E8%AE%B0%E5%BD%95/","excerpt":"","text":"个人背景高三因为厌学，然后家里有表哥的先例，和家人商议后选择了单招到湖南邮电职业技术学院移动通信技术专业。没有参考高考是我自己的选择，也没有家人强迫之类的，在此也感谢我的父母，尊重我的选择。 在19年那年单招考试成绩出了后，我便赴约去了深圳一趟（4月），见到了好多好多大佬。 一窗台手机的大佬 之后便回校参加校内的青春10000号（5月），就相当于打暑假工了。工作虽然不辛苦，但是很锻炼情绪，自己的坏习惯暴脾气给上班上没了，具体原因嘛，你猜。 上班到9月我就提桶跑步了，暑假工的钱，给父上大人换了一个K20Pro。 之后就是大学生活的日常了，军训，开学第一课…… 一切都很正常，是我想要的大学样子，自己也对现状很满意（伪）。 其实直到大三我才意识到这完全不是我想象中大学的样子，在大一上课我要么就是在玩斗地主要么就是在睡觉，室友开始逃课，我也开始逃课，不过晚上还是要上班。生活是真的充实，每天睡的很香。 要不被环境影响是很难的，自己也很难意识到，大专总体环境就不说了吧，就是网上说的大专现状那样子。但虽然是大专但也有好的老师，给予我很多启发以及帮助，比如王香英老师，熊雅豪老师、张倩老师…… 突如起来的疫情，让很多人都乱了手脚，我却很开心，到家不愁吃不愁穿，每天还能打游戏。开学的也是一个“假”开学。上课同学基本上不听，然后我也接着不听了，后来呢老师也摆烂。 疫情期间让我印象最深的是王老师不拘泥于网课形式，仍然对同学尽心尽力，连我也“被迫”参与其中，因为考核形式实在是不能摆，23333。 因为王老师的教学形式，我对英语的兴趣始终没有减退，从大二开始就一直记单词到现在，英语三、四级考试也成功顺利通过了，准备在本科冲一冲六级。 大二下到大三上是我觉醒的时期，因为在大二上的疫情期间，被人作为大专生瞧不起了，然后惨遭抛弃。这也是一个契机，凭啥就凭学历歧视人，我也没隐瞒我是大专生，就因为学历这样说别人，带专人人上人？我看未必。在校首先是知道了有个自考专升本，也报名了，后面才知道有统招的专升本。 大三上的后半个学期和暑假实习去了，这着实让我感觉到了生活的艰辛，并以此为契机开始努力学习了。 这种充实的生活引起我的警觉了，因为白天几乎没有闲着，晚上洗澡的时候思考人生。究竟适不适合干这种事（智能家居安装），觉得工作价值意义不太符合自己的观念。但是自己一直在以“提前体验生活、体验社会”为理由，让自己坚持。自己本身目的之一是拿到实习证明，第二是去得到社会经验。 from：https://ancient-pasta-c48.notion.site/2021-f233c5e6f5c3415595ef90778fb67f3a 2022年湖南专升本考试背景其实需要关注的文档只有一个，也就是你专科专业所属大类，关系到你可以选择的本科专业。 《湖南省2022年普通高校专升本考试对应专业（类）指导目录》 from：https://jyt.hunan.gov.cn/jyt/sjyt/hnsjyksy/web/ksyzcfg/202204/t20220418_22739135.html 比如我的是移动通信技术专业，所属专科专业大类是通信，然后可以报考本科的电子信息类和计算机类。湖南的政策是不允许跨考，也就是只能报考你专业相关的，这点同学们需要注意。 有一个培训机构专门做了一个网站，可以在上面查询可以报的专业和学校，就不用自己一个一个翻查了。 link：http://www.cnupp.com/chaxun/ 2022年专升本考试有所延期，在3月9日的时候发了推迟通知。我得以多了半个月学习时间，这至关重要！ 1.填报志愿时间由3月10日-15日延迟到3月22日-27日； 2.免试生录取完成时间由4月15日延迟至4月25日； 3.考试时间由4月20日-30日延迟到5月6日-16日； 4.录取时间由5月15日左右延迟到6月10日左右。 from：https://jyt.hunan.gov.cn/jyt/sjyt/hnsjyksy/web/ksygggs/202203/t20220309_22739656.html 反正需要时时刻刻关注招考动态，在学校官网和湖南省教育厅都会有通知的 关于择校其实也没有什么好选的，建议根据自己的学习情况，针对性的择校。如果自己觉得能力强的话，可以冲一冲，如果不太好还是保守点好。对于现在这个大环境下，有一个本科学历还是要比专科好的（先不论个人能力），自己一定要慎重选择，只有一次机会。我个人只是嫌弃民办学校学费太贵，不想给家里太大压力。大家一定要量力而行！参考上面的图我报的学校以及专业录取率**只有13.33%**。 from：https://www.bilibili.com/video/BV1VP4y1W7WE 关于考试以及备考在考试的前期学校官网会有考纲出来，关注学校官网以及教务处这两个地方！然后就可以看到你所要考的科目，以及考试范围（这个依学校来定） 由于是已经考完了才写的，所以我从考试角度先来分析一下吧，也对你们更有参考性一点。 考试阶段大学英语英语是四级难度差不多的水平，我也只考了73分。对于我仍然是完形填空和作文拉了，拿手的阅读理解试卷上只有两篇。 如何更能优化呢？这个不用多说吧。 理工专业基础数学则只考了高数上，当时看到考纲的时候只说了考同济高数这本书，我打电话给学校的老师问，也表示不清楚，要等老师。复习的时候我高数上下双修，最后没考是没想到的。 题目难度并不难，其中很多题目我都做过了。考察的重点是积分部分，比如说三角换元、裂项相消之类的。这种小技巧的并不太难的地方我都针对性的复习了，所以考试在这方面没有太丢分。最后一题是定积分求面积，没做出来（但那道题求体积我会做），题目我贴在下面了，有兴趣可以做一下。 最后考试考了87分，其实我考试的时候求不定积分常数 C 忘记写了，不过老师是人性化改卷，该扣的扣了该给的也给了。 程序设计基础最后一门是程序设计基础，这场考试刚拿到试卷我就窃喜了，因为：全！是！编！程！题！ 在学校发布的文件中，我很早就注意到了这句话 以程序设计工程应用能力考核为主 这代表了什么，代表了肯定是编程题占大头。没想到占这么大头，试卷一共5道题，每道题20分。前4道是C语言的，最后一道是数据库的。 题目都不难，数据库我认为比较难的 not exist 都没考，难度就到多表查询那么大。 C 语言的题目的难度呢，我认为在 OJ 里刷3天题目就够了，然后把谭书简单看一遍。 举一道题的例子吧，是这样的。 输入一个正整数，求这个数的偶数和（包括它本身） 例： 输入：5 输出：6 输入：8 输出：20 这是我认为在里面比较难的题目了，因为其他题目都是简单的输入输出循环控制。这道题稍微要动一点点脑子。 总结考试难度中等偏易，给的建议就是要全面复习，不要往难题钻，这也是我们数学老师多次强调的 在前期复习的时候我看的是 MOOC 上翁恺的课程，数据库看的是哈工大课程。 备考阶段按时间段叙述一下吧，具体的我也很难回忆起来了，很多东西都要翻找相册才能知道。 2021年7月7月13日，和家里人商量专升本事宜，表示支持。 7月15日报名缴费楚晟教育培训班，学费6***。 7-10月实习期间，学习时间极少 这是唯一在相册里找到的图片。 2021年10月10月15日参加学校毕业设计培训。 10月17日参加自考专升本考试。 10月24日开始跟培训班学习 2021年11月开始备考四级和自考英语考试，脱离宿舍生活。 图书馆周末不开门 一个人在操场上散步 一个人吃饭，有猫猫 某L送的四级模拟卷，帮大忙了。 2021年12月 - 2021年2月 回家过年 没有学习 2022年3月开始学习上线下课，已经意识到了紧迫性，因为在此之前，自己的学习时间仅仅只限于上课的时候，线下完全没有自己去主动学习。 这是Notion，用的b站Hannability的模板。 可以看出来我在2月前是比较难受的一个阶段，我自己可以把这段时间定义为自己的试错阶段吧，自己在不断尝试新方法来提高自己的学习力，再后面的几周就变样了，关于里面的内容我可以截取一周的给你们参考。 这是一个简单的 Tracker。 TDL 每天花5分钟写一写东西，保持输出能力。 然后后面几周的可见比以前的好很多了。 下面的是一些杂图 !","categories":[],"tags":[]},{"title":"数据库错题","slug":"数据库错题","date":"2022-05-18T12:36:20.534Z","updated":"2022-05-18T12:36:47.099Z","comments":true,"path":"2022/05/18/数据库错题/","link":"","permalink":"https://blog.irec.moe/2022/05/18/%E6%95%B0%E6%8D%AE%E5%BA%93%E9%94%99%E9%A2%98/","excerpt":"","text":"数据库错题下面列出的数据管理技术发展的三个阶段中，没有专门的软件对数据进行管理的是（ ）。 I．人工管理阶段 II．文件系统阶段 III．数据库阶段 A. I 和 II B. 只有 II C. II 和 III D. 只有 I 关于数据库系统语言，下列说法正确的是______。 A.数据库系统语言包括了DDL和DML B.数据库系统语言包括了DDL、DML和DCL C.数据库系统语言包括了DDL、DML和C++&#x2F;Java D.数据库系统语言包括了DDL、DML和程序设计语言 下列说法不正确的是_______________。 A.模式是对数据的抽象，数据的结构性描述称为模式 B.数据模型是对模式的抽象，模式的结构性描述称为数据模型 C.一个数据库是由一系列模式及其数据构成的 D.模式是对数据模型的抽象，数据模型的结构性描述称为模式 第一代数据库系统是指_______________。 A.文件系统 B.基于XML模型的数据库系统 C.基于关系模型的数据库系统 D.基于网状模型或层次模型的数据库系统 tip:是数据库系统，不是数据管理（记录）阶段 第二代数据库系统是指_______________。 A.基于文件的数据库系统； B.基于XML模型的数据库系统 C.基于网状模型或层次模型的数据库系统 D.基于关系模型的数据库系统 现有如下关系：患者（患者编号，患者姓名，性别，出生日期），医疗（患者编号，患者姓名，医生编号，医生姓名，诊断日期）。其中，“医疗”关系中的外键是_______ A.患者编号 B.患者姓名 C.患者编号和患者姓名 D.医生编号 关于关系模型完整性的说法，不正确的是___ A.外键如果取空值，则违反了参照完整性 B.数据库中有了空值会影响许多方面，如影响聚集函数运算的正确性等 C.用户自定义完整性是指用户针对具体的数据库应用所定义的完整性约束条件 D.实体完整性和参照完整性一般由DBMS系统自动支持 tips：外键可以为空，非空则要有对应的值 关于关系模式与关系，说法不正确的是_______ A.关系模式是稳定的；同一关系模式下，只有一种关系 B.同一关系模式下，可有很多的关系 C.关系模式是关系的结构, 关系是关系模式在某一时刻的数据 D.关系模式是稳定的；而关系是某一时刻的值，是随时间可能变化的 根据上述关系，求表R⋈W的结果_______ A. B. C. D.没有正确答案 系如下图所示，查询既学习课程号为001课程又学习课程号为002号课程的学生的学号,正确的是_______ A. B. C. D. tip：D选项查询结果为空，原因自己想。 关系R与关系S只有一个公共属性，T1是R与S做θ连接的结果，T2是R与S自然连接的结果，则下列说法正确的是_______ A.T1的属性个数大于T2的属性个数 B.T1 的属性个数等于T2 C.T1的属性个数小于T2 D.T1的属性个数大于或等于T2的属性个数 tip：做θ连接时不需要将公共属性合并，而自然连接时需要，所以 T1 的属性个数大于 T2 的属性个数 已知关系S(S#,Sname,Sage,Sclass), SC(S#,C#,Score)。如下所示关系代数表达式的含义是________。 A.其他全不对 B.查询没有学习过课程号为002号课程的学生姓名和年龄 C.查询不仅仅学习课程号为002号课程的学生姓名和年龄 D.查询学习课程号为002号课程的学生姓名和年龄 tips：此公式中 S X SC 运算之后 , 所有人都存在 C#&#x3D; 002 所以答案为空。 表达“从一个关系的所有行中提取出满足某些条件的行”，“从一个关系的所有列中提取出某些列”“提取出属于一个关系但不属于另一关系的所有元组”“将两个关系必须按照某种条件串接成一个较大的关系”的操作依次是__________。*1、并 2、交 3、积 4、选择 5、投影 6、差 7、连接* A.4567 B.4537 C.3567 D.4561 tip：理解概念，认真读题。错选的原因是没有读到 必须按照某种条件串接 并只是简单的并起来就行了。连接有很多中条件可以选。 设关系R与关系S具有相同的目数（或称度数），且相对应属性的值取自同一个域，则R-(R-S）等于_________。 A.R∩S B.R∪S C.S - R D.S tip：为 R 与 S 的交，由同时出现在 R 和 S 中的元组构成，交运算可以通过差运算来实现： R S&#x3D;R –(R S)&#x3D;S –(S R) INSERT INTO Goods(Name，Storage，Price) VALUES (’Keyboard’，3000，90.00)的作用是________。 A.添加数据到一行中的部分列 B.添加数据到一行中的所有列 C.插入默认值 D.插入多个行 tip:添加的可能是所有列，也可能是部分列。这题有歧义，没有给表结构 设关系Teacher的结构为：Teacher（T# char(3), Tname char(10), D# char(2), Salary float(2))，其中T#教师编号，Tname教师姓名，D#系号，Salary工资。Dept（D# char(2),Dname char(10),Dean char(10)),Dname系名，Dean系主任。若要将所有计算机系的教师工资上调10%，则可用_________。 A.Update Teacher Set Salary &#x3D; Salary * 1.1 Where D# in ( Select D# From Dept Where Dname&#x3D;‘计算机’); B.Update Salary &#x3D; Salary * 1.1 Where D# in ( Select D# From Dept Where Dname &#x3D;‘计算机’); C.Update Salary &#x3D; Salary * 1.1 Where D# in (Select D# From Dept Where Dname &#x3D; 计算机); D.Update TABLE Teacher Set Salary &#x3D; Salary * 1.1 Where D# in ( Select D# From Dept Where Dname &#x3D; ‘计算机’); tips：UPDATE 后直接接表名 陈述A：SubQuery1 UNION SubQuery2语句，其中SubQuery1和SubQuery2查询中相应的列必须以同一顺序出现。 陈述B：GROUP BY和HAVING子句不能在子查询中使用，这些子句只能用在最后一个查询结束时来总结和排序最后结果集。 关于陈述A和B，下列说法正确的是_________。 A.陈述A正确，陈述B错误 B.都是正确的 C.都是错误的 D.陈述A错误，陈述B正确 tips：对于并的理解 在SQL中，与”NOT IN”等价的操作符是_________。 A.&lt;&gt; ALL B.&#x3D; SOME C.&lt;&gt; SOME D.&#x3D; ALL tip：？？？不理解 已知如下关系：学生Student(S#, Sname)，课程Course(C#, Cname, T#)，选课SC(S#, C#, Score)，教师T(T#, Tname)。其中S#为学号，Sname为学生命名，C#为课号，Cname为课程名，T#为教师编号，Score为成绩，Tname为教师名。阅读SQL语句 SELECT S# FROM SC WHERE Score&lt;60 GROUP BY C# HAVING Count(*)&gt;2； 关于其查询结果，下列说法正确的是_____。 A.有2人以上不及格课程的同学的学号 &#x2F;&#x2F; 有2人以上不及格的课程，学习该课程的同学的学号 B.有2门以上不及格课程的同学的学号 C.有2门以上及格课程的同学的学号 D.有2人以上及格课程的同学的学号 tips：傻逼题，自己理解 假设一个元组在子查询1中出现m次，在子查询2中出现n次，其中m&gt;0,n&gt;0, 则下列说法正确的是________。 A.该元组在“子查询1 Except 子查询2”中出现0次； B.该元组在“子查询1 Union 子查询2”中出现m + n次； C.该元组在 “子查询1 Except ALL 子查询2”中出现m – n次； D.该元组在“子查询1 Intersect 子查询2”中出现min(m,n)次； 假设一个元组在子查询1中出现m次，在子查询2中出现n次，其中m&gt;0,n&gt;0,则下列说法正确的是_________。 A.该元组在“子查询1 Union ALL 子查询2”中出现m + n次； B.该元组在 “子查询1 Union 子查询2”中出现m+n次； C.该元组在“子查询1 Union ALL 子查询2”中出现1次； D.该元组在 “子查询1 Union 子查询2”中出现Min(m,n)次； 假设一个元组在子查询1中出现m次，在子查询2中出现n次，其中m&gt;0,n&gt;0,则下列说法正确的是_________。 A.该元组在“子查询1 Except 子查询2”中出现0次； B.该元组在“子查询1 Union 子查询2”中出现m + n次； C.该元组在 “子查询1 Except All 子查询2”中出现m – n次； D.该元组在“子查询1 Union All 子查询2”中出现max(m,n)次； 有一个学生表student，包含主键S#（学生编号）等。又有分数表SC，包含S#（学生编号）、score（分数）等。已知student表中共有50个学生，有45人参加了考试（分数存在SC表中），其中10人不及格。执行以下SQL语句：select * from student where exists (select S# from SC where score&lt;60 )， 可返回_________条记录。 A.50 B.45 C.10 D.35 tips：因为这是非相关子查询，而且子查询始终为真(因为已知有10人不及格)，故检索出的是Student表中的所有记录。 难点：并、交 exists嵌套双重否定的理解 关于数据库设计，下列说法正确的是 。 A.若要开发一个信息系统，首先要确定使用哪一个DBMS来进行管理，然后才能进行数据库设计 B.概念数据库设计需要关注用E-R Diagram的思想来理解需求，而不能仅仅关注绘制E-R Diagram的图形 C.逻辑数据库设计的关注点是属性、结构和命名的冲突问题，数据库设计的规范性问题和DBMS的选型问题 D.物理数据库设计仅需要考虑数据量的大小、磁盘空间占用及存储结构等特性，但无关具体的DBMS tips：逻辑数据库不需要关注DBMS选型 若要将E-R图转换成关系模式，转换正确的是_________。 A.学生(学号，课程号，…)；课程(课程号，…) B.选修(学号，课程号，…) C.学生(学号，…)；课程 (课程号，学号，…..) D.学生(学号，…)；课程(课程号，…)；选修(学号，课程号，…) tips：多对多应新建一个关系作为练习 关于E-R 图向关系模式的转换的规则正确的是_________。 A.复合属性转换时只能将每个分量属性作为所在实体对应关系的属性 B.一对一联系的转换只能将联系定义为一个新的关系，再将属性设为参与双方的关键字属性 C.泛化实体与具体化实体在转换时，可以不要泛化实体，而仅将具体化实体转换成关系 D.一对多联系的转换，需将多方参与实体的关键字作为单方参与实体对应关系的属性 tips：D选项说反了，语文理解问题，自己体会。我也看不懂。反正是要把只有一个的那边的属性，加到有很多个个体的属性里面去。 一对多联系的转换，需将单方参与实体的关键字作为多方参与实体对应关系的属性。 如：商店（商店名，xxx）、商品（商品号，xxx，商店名）。1：N关系 下列由E-R图向关系模式转换具体实例中，明显不正确的是________。注意：关系模式中带下划线的属性为主键。 A. B. C. D. tips：注意D选项的已知 在关系模式R(U，F)中，如果F是最小函数依赖集，则____________。 A.R∈2NF B.R∈3NF C.R∈BCNF D.R的规范化程度与F是否最小函数依赖集无关。 tips：D 一般情况，企业会将从一个供应商处一次所进的多种货物办理一次入库，因此设计了关系模式：入库单(单号, 日期, 库房, 供应商，物品, 数量, 金额)，下列说法正确的是___ ______。 A.不满足第2范式 B.满足第2范式但不满足第3范式 C.满足第3范式 D.其他都不对 对设备管理，请分析关系模式：设备(设备编号, 设备名, 生产商编号，生产商名称，生产商地址，配件编号，配件名称，配件价格，设备价格)，说法正确的是_______________。 A.不满足第2范式 B.满足第2范式但不满足第3范式 C.满足第3范式 D.其他不对","categories":[],"tags":[]},{"title":"数据库笔记","slug":"数据库笔记","date":"2022-05-18T12:36:20.527Z","updated":"2022-05-18T12:36:48.576Z","comments":true,"path":"2022/05/18/数据库笔记/","link":"","permalink":"https://blog.irec.moe/2022/05/18/%E6%95%B0%E6%8D%AE%E5%BA%93%E7%AC%94%E8%AE%B0/","excerpt":"","text":"数据库笔记第1章 绪论1.1 数据库系统概论1.2 数据模型数据模型是对现实世界数据特征的抽象 数据模型是数据库系统的核心和基础 两类数据模型概念模型（信息模型）：按用户的观点来对数据和信息建模，用于数据库设计 逻辑模型（网状模型、层次模型、关系模型、面向对象数据模型….）：按计算机系统的观点对数据建模、数据库管理系统的实现 物理模型： 描述数据在系统内（磁盘上）的表示方法和存取方法 现实世界 –&gt; 概念模型：数据库设计人员完成 概念模型 –&gt; 逻辑模型：数据库设计人员完成、数据库设计工具协助完成 概念模型实体-联系（Entity-Relationship）：用E-R图来描述现实世界的概念模型 实体：具体的人、事或抽象的概念（例如学生 属性：就是属性 码：唯一标识 实体型：实体名+属性名来抽象刻画同类实体 实体集：同一类型实体的集合 联系：就是联系 实体内部的联系：各属性之间的关系 实体之间的联系：不同实体集之间的联系（1 : 1、1 : M、M : N） 数据模型：是严格定义的一组概念的集合数据结构：组成对象和对象之间的联系 数据操作：对数据库允许执行的操作的集合。就是对操作的规则 数据的完整性约束：要让数据库符合这种规则不让数据库乱七八糟（主键必须存在，如果有引用的外键，要怎么怎么样做之类 关系数据模型是目前最重要的一种数据模型，它的三个要素分别是（ ） A. 实体完整性、参照完整性、用户自定义完整性 B. 数据结构、关系操作、完整性约束 C. 数据增加、数据修改、数据查询 D. 外模式、模式、内模式 这题和哪种数据模型没关系，数据模型通常都由那三种组成的。 常用的数据模型 格式化模型中的数据结构的单位：基本层次联系 层次模型表示方法：实体型、属性、联系 定义：1、只有一个节点没有双亲节点，这个节点叫根节点 ​ 2、根以外的其他节点只有一个双亲节点 特点：1、节点双亲唯一 ​ 2、只能直接处理一对多 ​ 3、不能脱离双亲独立存在 ​ 4、任何记录只能一层一层找下去 优点：1、数据结构清晰 ​ 2、查询效率高，性能优于关系模型 ​ 3、良好的完整性支持 缺点：1、多对多联系不太好 ​ 2、插入和删除限制多 ​ 3、查询子女节点必须经过双亲节点 网状模型表示方法同层次模型 定义：1、允许一个以上的节点无双亲 ​ 2、一个节点可以有多个双亲 ​ 3、两个节点有多种联系 多对多在网状模型中的表示：多对多分解成一对多 完整性约束条件不严格： 1、允许插入未确定双亲结点值的子女节点值 2、允许只删除双亲节点值 实际的网状数据库系统： 1、支持码 2、保证一个联系中双亲记录和子女记录之间是一对多联系 3、可以定义双亲记录和子女记录之间某些约束条件 例：要求双亲记录存在才能插入子女记录，双亲记录删除时也同时删除。 ​ 学生选课记录值中学号必须是学生记录中存在的某一学生学号， ​ 课程号必须是课程记录中存在的某一门课程号。 优点：1、更加直接的描述现实世界，一个节点多个双亲 ​ 2、性能高 缺点：1、结构复杂 ​ 2、DDL、DML 语言太难 关系模型关系（Relation）：一张表 元组（Tuple）：一行即为一个元组 属性（Attribute）：一列即为一个属性 主码（Key）：唯一确定一个元组 域（Domain）：一组具有相同数据类型的值的集合，属性的取值范围来自域** 分量：元组中的一个属性值 关系模式：对关系的描述 ​ 学生（学号，姓名，年级，年龄） 关系必须是规范化的，关系的每一个分量必须是一个不可再分的数据项（这个好理解周老师讲过了，列中有列） 数据操作都是集合操作：操作对象和操作结果都是关系 优点：1、建立在严格的数学概念的基础上 ​ 2、概念单一：实体和各类联系都用关系来表示，对数据的检索结果也是关系 ​ 3、关系模型的存储路径对用户透明 缺点：由于存储路径透明，查询效率不如格式化数据模型。为了提高效率必须对用户的查询请求进行优化（例如缩小查询范围，多表关联的时候先筛一部分） 1.3 数据库系统的结构开发人员角度：三级模式结构。数据库系统内部的系统结构 用户角度：单用户结构、主从式结构、分布式结构、客户-服务器、浏览器-应用服务器 &#x2F; 数据库服务器 模式的概念模式：对数据库逻辑结构和特征的描述（学生表） 实例：模式的具体值（升本成功的所有学生的记录、没有升本成功的所有学生的记录） 模式是固定的、示例是变化的 三级模式 多个 外模式（子模式、用户模式）：数据库用户使用的局部数据的逻辑结构和特征的描述 ​ 与模式的关系：通常是模式的子集、一个模式有多个外模式 ​ 与应用的关系：一个外模式可以为多个应用系统所使用，一个应用程序只能使用一个外模式 ​ 用途：简化用户视图。保证数据库安全性 一个 模式（逻辑模式）：数据库中全体数据的逻辑结构和特征的描述 ​ 定义：1、用 DDL 定义数据的逻辑结构 ​ 2、定义数据之间的联系 ​ 3、定义数据有关的安全性、完整性要求 一个 内模式（存储模式）：物理结构和存储方式的描述 二级映像外模式 -&gt; 模式 定义外模式和模式之间的对应关系 映像定义 通常包含在各外模式的描述中 每一个外模式都有一个 外模式 -&gt; 模式 映像 保证数据的逻辑独立性：当模式改变时，DBA 对 外模式 &#x2F; 模式 映像做相应改变，使外模式保持不变。应用程序是依据数据的外模式编写的，应用程序不用改，保证了数据与程序的逻辑独立性，简称RT 模式 -&gt; 内模式 定义数据全局逻辑结构与存储结构之间的对应关系 这个映像是唯一的，保证数据的物理独立性 优势：保证了应用程序的稳定性 ​ 以程序为中心 -&gt; 以数据为中心 ​ 数据的存取由数据库管理系统管理 1.4 数据库系统的组成1、硬件平台及数据库：大内存、大磁盘、大通道 2、软件：数据库管理系统、操作系统、与数据库接口的高级语言及其编译系统、应用开发工具、数据库应用系统 3、人员：用户、应用程序员、系统分析员和数据库设计人员、数据库管理员 1、数据库管理员：略 2、系统分析员：负责应用系统的需求分析和规范说明 ​ 与用户及数据库管理员结合，确定系统的硬软件配置 ​ 参与数据库系统的概要设计 ​ 数据库设计人员：参加用户需求调查和系统分析确定数据库中的数据 ​ 设计数据库各级模式 3、应用程序员：设计和编写应用系统的程序模块进行调试和安装 4、用户：通过应用系统的用户接口使用数据库 1.5 小结重点：概念模型的基本概念、数据模型的3个组成要素、三模两映、数据库系统的逻辑独立性和物理独立性 第10章 数据库恢复技术事务的四大特性：ACID Atom 原子性 Consistent 一致性 Isolate 隔离性 Duration 持久性 第11章 并发控制并发带来的问题丢失修改 读脏数据 不可重复读 解决办法排他锁：写锁 X锁 共享锁：读锁 S锁 封锁协议一级封锁协议：修改时，必须加X锁，直到结束。 二级封锁协议：读的时候，加S锁，用完就放。 三级封锁协议：读的时候，加S锁，直到结束。","categories":[],"tags":[]}],"categories":[],"tags":[]}